# EcoGreenHouse
**Συμμετοχή στον 4ο πανελλήνιο διαγωνισμό Ανοιχτών Τεχνολογιών
4ο Πειραματικό Δημοτικό Σύρου - Δημοτικό Σχολείο Βάρης Μάννα Σύρου
**

Το θερμοκήπιο θα παρέχει τη δυνατότητα:
- συλλογής βρόχινου νερού, 
- αυτοματοποιημένου ποτίσματος, 
- σύστημα ελέγχου ανάπτυξης των φυτών (φωτοσύνθεσης, ζέστης, υγρασίας, αερισμού), 
- αυτονομία ενέργειας

Επίσης θα φτιαχτεί κάδος κομποστοποίησης των φυτικών υπολειμμάτων (κλαδιών, φύλλων κτλ).

Πιο συγκεκριμένα :

**Συλλογή νερού** : Θα συλλέγεται από την οροφή του θερμοκηπίου βρόχινου νερού και θα αποθηκεύεται σε δεξαμενή. Νερό θα αντλείται από πηγάδι, εφόσον η δεξαμενή είναι άδεια. Το σύστημα θα είναι αυτόματο ώστε να χρησιμοποιείται βέλτιστα το βρόχινο νερό, δηλ μόνο όταν είναι αναγκαίο θα χρησιμοποιείται το πηγάδι για πότισμα.

**Αυτοματοποιημένο πότισμα** : Με 2 αισθητήρες υγρασίας θα ελέγχεται η ανάγκη για πότισμα. Σε αυτή την περίπτωση ηλεκτρική βάνα θα τροφοδοτεί αυτόματα με νερό τα φυτά.

**Σύστημα ελέγχου ανάπτυξης των φυτών** : Θα ελέγχεται η ηλιοφάνεια και σε περίπτωση που χρειάζεται, λαμπτήρες θα παρέχουν φωτισμό στα φυτά. Ανεμιστήρας σε συνδυασμό με τους αισθητήρες θερμοκρασίας θα ελέγχει την θερμοκρασία μέσα στο θερμοκήπιο και ανάλογα θα ανοιγοκλείνει το παράθυρο αερισμού. Για θέρμανση θα χρησιμοποιηθούν πάλι λαμπτήρες πάνω από κάθε φυτό.

**Παροχή ενέργειας** : Η ενέργεια που θα χρειάζεται το σύστημα θα παρέχεται από επαναφορτιζόμενες μπαταρίες οι οποίες θα φορτίζονται από ηλιακό πάνελ.

**Κάδος κομποστοποίησης**: Κομποστοποιούνται τα φυτικά υπολείμματα και γίνονται λίπασμα για τα φυτά.

Ο αγρότης θα έχει όλες τις ενδείξεις που χρειάζονται, σε οθόνη εκτός θερμοκηπίου,  ώστε να πληροφορείται για την κατάσταση του θερμοκηπίου.
